InformationRegisters/НастройкиСинхронизацииMSExchange.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиСинхронизацииMSExchange</Name>
			<Comment>АПК:58 полное наименование слишком длинное</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СерверMSExchange</Name>
					<Comment>АПК:58 полное наименование слишком длинное</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СерверыMSExchange</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.СинхронизацияКалендарей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыСинхронизацииКалендарей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыСинхронизацииКалендарей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Google</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DAV</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>MSExchange</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВерсииСерверовMSExchange.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВерсииСерверовMSExchange</Name>
			<Comment>АПК:58 полное наименование слишком длинное</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Exchange2010</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Exchange2013</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Exchange2016</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Exchange2019</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СерверыMSExchange.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СерверыMSExchange</Name>
			<Comment>АПК:58 полное наименование слишком длинное</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресРесурса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьАутентификациюОС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияСервера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВерсииСерверовMSExchange</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтактнойИнформацииПользователей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтактнойИнформацииПомещений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/НастройкиСинхронизацииMSExchange/Forms/НастройкаПодключенияMSExchange/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.АвтообнаружениеУспешноГруппа.Видимость = Ложь;
	
	Если Параметры.Свойство("Ключ") Тогда
		Узел = Параметры.Ключ.Узел;
		ЗаполнитьПоУзлу();
	Иначе
		СерверПоУмолчанию = СерверПоУмолчанию();
		
		Если СерверПоУмолчанию.Количество() = 0 Тогда
			СоздатьНовыйСервер = 1;
			ЗаполнитьНастройкиПоУмолчанию();
		Иначе
			СоздатьНовыйСервер = 0;
			СерверMSExchange = СерверПоУмолчанию[0];
			ЗаполнитьНастройкиПоСерверу();
		КонецЕсли;
	КонецЕсли;
	
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если СоздатьНовыйСервер = 0 Тогда
		ПроверяемыеРеквизиты.Добавить("СерверMSExchange");
	Иначе
		ПроверяемыеРеквизиты.Добавить("СтрокаПодключения");
		ПроверяемыеРеквизиты.Добавить("ВерсияСервера");
		ПроверяемыеРеквизиты.Добавить("ВидКонтактнойИнформацииПользователей");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность И ЗавершениеРаботы Тогда
		Отказ = Истина;
	ИначеЕсли Модифицированность Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаВопросаПередЗакрытием", ЭтотОбъект),
			НСтр("ru = 'Данные были изменены. Сохранить изменения?'"),
			РежимДиалогаВопрос.ДаНетОтмена);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДляКогоПриИзменении(Элемент)
	
	Если ЕстьУчетнаяЗапись() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для пользователя уже есть учетная запись.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛогинПриИзменении(Элемент)
	
	Пароль = "";
	ПарольИзменен = Истина;
	Элементы.АвтообнаружениеУспешноГруппа.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	ПарольИзменен = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СерверMSExchangeПриИзменении(Элемент)
	
	ЗаполнитьНастройкиПоСерверу();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСерверПриИзменении(Элемент)

	Если СоздатьНовыйСервер = 0 Тогда
		ЗаполнитьНастройкиПоСерверу();
		УстановитьДоступностьЭлементов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСерверПриИзменении(Элемент)
	
	Если СоздатьНовыйСервер = 1 Тогда
		ЗаполнитьНастройкиПоУмолчанию();
		УстановитьДоступностьЭлементов();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)

	Если ПроверитьЗаполнение() Тогда
		ЗаписатьНаСервере();
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		ЗаписатьНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоединение(Команда)

	Если Модифицированность Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаВопросаПроверитьСоединение", ЭтотОбъект),
			НСтр("ru = 'Данные были изменены. Сохранить изменения?'"),
			РежимДиалогаВопрос.ДаНетОтмена);
	Иначе
		СинхронизацияMSExchangeКлиент.ПроверитьСоединение(Узел);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура РазобратьСтрокуПодключения()
	
	СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(СтрокаПодключения);
	
	ИспользоватьЗащищенноеСоединение = (СтруктураURI.Схема = "https");
	Сервер = СтруктураURI.Хост;
	Порт = ?(СтруктураURI.Порт = Неопределено, 0, Число(СтруктураURI.Порт));
	АдресРесурса = СтруктураURI.ПутьНаСервере;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	Если Не Модифицированность Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		ЗаписатьДанныеУчетнойЗаписи();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение НСтр("ru = 'Произошла ошибка при записи данных.'") + Символы.ПС + ОписаниеОшибки();
	КонецПопытки;
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеУчетнойЗаписи()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(Узел) Тогда
		Узел = ПланыОбмена.СинхронизацияКалендарей.СсылкаНовогоУзла(
			Пользователь, ПредопределенноеЗначение("Перечисление.ТипыСинхронизацииКалендарей.MSExchange"));

		УзелОбъект = Узел.ПолучитьОбъект();
		УзелОбъект.Включен = Истина;
		СтрокаКалендари = УзелОбъект.Календари.Добавить();
		СтрокаКалендари.Чтение = Истина;
		СтрокаКалендари.Изменение = Истина;
		СтрокаКалендари.Наименование = НСтр("ru = 'Календарь'");
		СтрокаКалендари.Идентификатор = "calendar";
		УзелОбъект.Записать();
	КонецЕсли;
	
	Если СоздатьНовыйСервер = 1 Тогда
		РазобратьСтрокуПодключения();
		НовыйСервер = Справочники.СерверыMSExchange.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(НовыйСервер, ЭтотОбъект);
		НовыйСервер.Наименование = СтрокаПодключения;
		НовыйСервер.Таймаут = 30;
		НовыйСервер.Записать();
		СерверMSExchange = НовыйСервер.Ссылка;
	КонецЕсли;
	
	Запись = РегистрыСведений.НастройкиСинхронизацииMSExchange.СоздатьМенеджерЗаписи();
	Запись.Узел = Узел;
	Запись.СерверMSExchange = СерверMSExchange;
	Запись.ИмяПользователя = ИмяПользователя;
	Запись.Записать();
	
	Если ПарольИзменен Тогда
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Узел, Пароль, "Пароль");
		Пароль = ?(ЗначениеЗаполнено(Пароль), ЭтотОбъект.УникальныйИдентификатор, "");
		ПарольИзменен = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СерверПоУмолчанию()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СерверыMSExchange.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СерверыMSExchange КАК СерверыMSExchange
	|ГДЕ
	|	НЕ СерверыMSExchange.ПометкаУдаления");
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПоУзлу()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Настройки.Узел.Пользователь КАК Пользователь,
	|	Настройки.СерверMSExchange КАК СерверMSExchange,
	|	Настройки.ИмяПользователя КАК ИмяПользователя,
	|	Настройки.СерверMSExchange.ИспользоватьАутентификациюОС КАК ИспользоватьАутентификациюОС,
	|	Настройки.СерверMSExchange.ВерсияСервера КАК ВерсияСервера,
	|	Настройки.СерверMSExchange.ВидКонтактнойИнформацииПользователей КАК ВидКонтактнойИнформацииПользователей,
	|	Настройки.СерверMSExchange.ВидКонтактнойИнформацииПомещений КАК ВидКонтактнойИнформацииПомещений
	|ИЗ
	|	РегистрСведений.НастройкиСинхронизацииMSExchange КАК Настройки
	|ГДЕ
	|	Настройки.Узел = &Узел");
	Запрос.УстановитьПараметр("Узел", Узел);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РезультатЗапроса.Выгрузить()[0]);
	
	УстановитьПривилегированныйРежим(Истина);
	Пароль = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Узел, "Пароль");
	УстановитьПривилегированныйРежим(Ложь);
	Пароль = ?(ЗначениеЗаполнено(Пароль), ЭтотОбъект.УникальныйИдентификатор, "");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиПоУмолчанию()
	
	ИспользоватьАутентификациюОС = Ложь;
	ВерсияСервера = ПредопределенноеЗначение("Перечисление.ВерсииСерверовMSExchange.Exchange2010");
	ВидКонтактнойИнформацииПользователей = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailФизическиеЛица");
	ВидКонтактнойИнформацииПомещений = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailТерриторииИПомещения");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиПоСерверу()
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, СерверMSExchange,
		"ИспользоватьАутентификациюОС, ВерсияСервера,
		| ВидКонтактнойИнформацииПользователей, ВидКонтактнойИнформацииПомещений");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементов()
	
	Элементы.СерверMSExchange.Доступность = (СоздатьНовыйСервер = 0);
	Элементы.СтрокаПодключения.Доступность = (СоздатьНовыйСервер = 1);
	Элементы.НастройкиСервераГруппа.Доступность = (СоздатьНовыйСервер = 1);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаПередЗакрытием(РезультатВопроса, ДополнительныеПараметры) Экспорт

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Если ПроверитьЗаполнение() Тогда
			ЗаписатьНаСервере();
			Закрыть();
		КонецЕсли;
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаПроверитьСоединение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Если ПроверитьЗаполнение() Тогда
			ЗаписатьНаСервере();
			СинхронизацияMSExchangeКлиент.ПроверитьСоединение(Узел);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕстьУчетнаяЗапись()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиСинхронизацииMSExchange.Узел КАК Узел
	|ИЗ
	|	РегистрСведений.НастройкиСинхронизацииMSExchange КАК НастройкиСинхронизацииMSExchange
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланОбмена.СинхронизацияКалендарей КАК СинхронизацияКалендарей
	|		ПО НастройкиСинхронизацииMSExchange.Узел = СинхронизацияКалендарей.Ссылка
	|ГДЕ
	|	СинхронизацияКалендарей.Пользователь = &Пользователь
	|	И СинхронизацияКалендарей.ТипСинхронизации = &ТипСинхронизации");
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ТипСинхронизации", ПредопределенноеЗначение("Перечисление.ТипыСинхронизацииКалендарей.MSExchange"));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Узел = РезультатЗапроса.Выгрузить()[0].Узел;
		ЗаполнитьПоУзлу();
		Модифицированность = Ложь;
	КонецЕсли;
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

#КонецОбласти
